jmeter/Representative/taurus_perf_env.yml
modules:
  jmeter:
    gui: false
    properties:
      invite_users : 1
      applicant_users : 10
      registration_users : 1
      front_door_users : 10
      competition_management_users : 10
      assessor_users : 50
      global_pause_deviation : 100
      micro_pause_deviation : 100
      short_pause_deviation : 500
      normal_pause_deviation : 5000
      long_pause_deviation : 10000
      longer_pause_deviation : 15000
      server_url : perf.apps.prod.ifs-test-clusters.com
      authorisation_url : auth-perf.apps.prod.ifs-test-clusters.com
      users_csv : user_data.csv
      competitions_csv : competition_data.csv
      invites_csv : invite_data.csv
      assessor_csv : assessor_data.csv
      front_door_competitions_csv : front-door-competitions.csv
      summariser.name : summary
      summariser.interval : 5
      summariser.log : true
      summariser.out : true

execution:
- iterations: 1
  concurrency: 150
  scenario: with_script


scenarios:
  with_script:
    script: load_test_representative.jmx

reporting:
- module: passfail
  criteria:
  - "fail>50% for 10s, stop as failed"